return {
	"goolord/alpha-nvim",
	dependencies = {
		"nvim-tree/nvim-web-devicons",
	},

	config = function()
		local alpha = require("alpha")
		local dashboard = require("alpha.themes.dashboard") -- use dashboard theme

		dashboard.section.header.val = {
			[[                  ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⣿⣿⣿⡿⢿⡿⠿⠿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⡿⣿⣿]],
			[[                  ⣿⣿⣿⣿⠿⠿⢿⣿⣿⠟⣋⣭⣶⣶⣞⣿⣶⣶⣶⣬⣉⠻⣿⣿⡿⣋⣉⠻⣿⣿⣿]],
			[[                  ⣿⢻⣿⠃⣤⣤⣢⣍⣴⣿⢋⣵⣿⣿⣿⣿⣷⣶⣝⣿⣿⣧⣄⢉⣜⣥⣜⢷⢹⢇⢛]],
			[[                  ⡏⡦⡁⡸⢛⡴⢣⣾⢟⣿⣿⣿⢟⣾⣧⣙⢿⣿⣿⣿⣿⣿⣿⣿⢩⢳⣞⢿⡏⢷⣾]],
			[[                  ⣷⣵⡇⣗⡾⢁⣾⣟⣾⣿⡿⣻⣾⣿⣿⣿⡎⠛⡛⢿⣿⡟⣿⣿⡜⡜⢿⡌⠇⢾⣿]],
			[[                  ⣿⣿⠁⣾⠏⣾⣿⣿⣽⣑⣺⣥⣿⣿⣿⣿⣷⣶⣦⣖⢝⢿⣿⣿⣿⡀⠹⣿⣼⢸⣿]],
			[[                  ⣿⣿⢰⡏⢡⣿⣿⠐⣵⠿⠛⠛⣿⣿⣿⣿⣿⠍⠚⢙⠻⢦⣼⣿⣿⠁⣄⣿⣿⠘⣿]],
			[[                  ⣿⣿⢸⢹⢈⣿⣿⠘⣡⡞⠉⡀⢻⣿⣿⣿⣿⢃⠠⢈⢳⣌⣩⣿⣿⠰⠿⢼⣿⠀⣿]],
			[[                  ⣿⠿⣘⠯⠌⡟⣿⡟⣾⣇⢾⡵⣹⣟⣿⣿⣿⣮⣓⣫⣿⣟⢿⣿⢿⡾⡹⢆⣦⣤⢹]],
			[[                  ⣅⣛⠶⠽⣧⣋⠳⡓⢿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⣿⣫⣸⠏⡋⠷⣛⣫⡍⣶⣿]],
			[[                               ]],
			[[███████╗██╗███████╗██╗  ██╗███████╗   ███╗   ██╗██╗   ██╗██╗███╗   ███╗]],
			[[╚══███╔╝██║██╔════╝██║ ██╔╝██╔════╝   ████╗  ██║██║   ██║██║████╗ ████║]],
			[[  ███╔╝ ██║█████╗  █████╔╝ ███████╗   ██╔██╗ ██║██║   ██║██║██╔████╔██║]],
			[[ ███╔╝  ██║██╔══╝  ██╔═██╗ ╚════██║   ██║╚██╗██║╚██╗ ██╔╝██║██║╚██╔╝██║]],
			[[███████╗██║███████╗██║  ██╗███████║██╗██║ ╚████║ ╚████╔╝ ██║██║ ╚═╝ ██║]],
			[[╚══════╝╚═╝╚══════╝╚═╝  ╚═╝╚══════╝╚═╝╚═╝  ╚═══╝  ╚═══╝  ╚═╝╚═╝     ╚═╝]],
		}

		-- BUTTONS
		dashboard.section.buttons.val = {
			dashboard.button("e", "  New file", ":ene <BAR> startinsert<CR>"),
			dashboard.button("f", "  Find file", ":Telescope find_files<CR>"),
			dashboard.button("r", "  Recent files", ":Telescope oldfiles<CR>"),
			dashboard.button("m", "  Mason", ":Mason<CR>"),
			dashboard.button("l", "󰒲  Lazy", ":Lazy<CR>"),
			dashboard.button("s", "  Settings", ":e $MYVIMRC<CR>"),
			dashboard.button("q", "  Quit", ":qa<CR>"),
		}

		-- FOOTER
		local stats = require("lazy").stats()
		local ms = (stats.startuptime or 0)
		dashboard.section.footer.val = "Plugins loaded in " .. ms .. " ms | Welcome to Neovim! 🌙"
		dashboard.section.footer.opts.hl = "Type"

		-- CENTER HORIZONTALLY
		for _, section in pairs(dashboard.section) do
			section.opts.hl = "Comment"
			section.opts.position = "center"
		end

		-- CENTER VERTICALLY
		local top_padding = math.floor(vim.o.lines * 0.25)
		dashboard.section.header.opts.padding = top_padding

		alpha.setup(dashboard.opts)
	end,
}
